Revit 2027 API
ScheduleFieldId.IntegerValue Property
 Provides the value of the ScheduleFieldId as an integer.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int IntegerValue { get; }
Public ReadOnly Property IntegerValue As Integer
	Get
public:
property int IntegerValue {
	int get ();
}
member IntegerValue : int with get
Property Value
Int32
See Also
Reference
ScheduleFieldId Class
Autodesk.Revit.DB Namespace